{
  "Header": {
    "Name": "Sergio González Sánchez",
    "TechStack": [
      "Frontend Developer",
      "Frontend Architect",
      "Figma",
      "HTML",
      "CSS",
      "JavaScript",
      "TypeScript",
      "Node.js",
      "React.js",
      "React Native",
      "Next.js",
      "Manejo de Estado",
      "Pruebas Unitarias",
      "Pruebas de Integración",
      "Pruebas End-to-End",
      "React Hook Form",
      "SCRUM",
      "Patrones de Diseño",
      "Profesor de Desarrollo de Software"
    ],
    "Contact": {
      "City": "Medellín, Colombia",
      "Phone": "+57 3053957009",
      "Email": "soysergiogonza@gmail.com"
    },
    "Links": [
      {
        "title": "LinkedIn",
        "url": "https://www.linkedin.com/in/soysergiogonza/",
        "icon": "linkedin"
      },
      {
        "title": "GitHub",
        "url": "https://github.com/soysergiogonza",
        "icon": "github"
      },
      {
        "title": "sergiogonzalez.tech",
        "url": "https://sergiogonzalez.vercel.app/",
        "icon": "globe"
      }
    ]
  },
  "Links": {
    "sectionTitle": "Enlaces",
    "LinkList": [
      {
        "title": "LinkedIn",
        "url": "https://www.linkedin.com/in/soysergiogonza/"
      },
      {
        "title": "GitHub",
        "url": "https://github.com/soysergiogonza"
      },
      {
        "title": "sergiogonzalez.tech",
        "url": "https://sergiogonzalez.vercel.app/"
      }
    ]
  },
  "Profile": {
    "sectionTitle": "Perfil Profesional",
    "profiles": [
      {
        "id": "1",
        "title": "Desarrollador Frontend",
        "company": "Globant",
        "date": "2024-04-25",
        "content": [
          "Desarrollador Frontend con más de 3 años de experiencia, especializado en la creación de productos web escalables y de alta calidad. Experto en arquitectura frontend limpia y micro-frontends, con sólido dominio de TypeScript, React, Next.js y gestión de estado con Redux y React Query. Competente en React Native y tecnologías UI como Figma, CSS Vanilla, Tailwind y Material UI.",
          "Mi experiencia en startups estadounidenses me ha permitido liderar proyectos de comercio electrónico y plataformas administrativas, aplicando las mejores prácticas de la industria y metodologías ágiles. Destaco por mi capacidad para resolver problemas complejos y entregar soluciones técnicas robustas y mantenibles."
        ]
      },
      {
        "id": "2",
        "title": "Líder Técnico Frontend",
        "company": "Mercado Libre",
        "date": "2024",
        "content": [
          "Líder Técnico Frontend con más de 3 años de experiencia, especializado en arquitectura de software y gestión de equipos técnicos. Experto en el diseño e implementación de soluciones escalables utilizando micro-frontends y arquitectura limpia. Dominio avanzado de TypeScript, React, Next.js y patrones de gestión de estado con Redux y React Query.",
          "He liderado equipos técnicos en startups estadounidenses, dirigiendo el desarrollo de plataformas de comercio electrónico y sistemas administrativos complejos. Mi enfoque combina una sólida experiencia técnica con habilidades de liderazgo, facilitando la entrega de productos de alta calidad y el crecimiento profesional del equipo."
        ]
      },
      {
        "id": "3",
        "title": "Desarrollador Frontend / Educador",
        "company": "Platzi",
        "date": "2024",
        "content": [
          "Desarrollador Frontend y Educador en Desarrollo de Software con más de 3 años de experiencia combinada. Especializado en el desarrollo de aplicaciones web modernas utilizando TypeScript, React, Next.js y arquitecturas frontend avanzadas. Experto en la implementación de micro-frontends y patrones de diseño escalables.",
          "Como profesor de Análisis y Desarrollo de Software, he desarrollado una capacidad excepcional para comunicar conceptos técnicos complejos y mentorear a futuros desarrolladores. Mi experiencia práctica en startups estadounidenses, combinada con mi rol docente, me permite aportar una perspectiva única que combina la excelencia técnica con habilidades efectivas de comunicación y mentoría."
        ]
      },
      {
        "id": "1",
        "title": "Frontend Developer / TypeScript Engineer",
        "company": "Globant",
        "date": "2024-04-25",
        "content": [
          "Frontend Developer with 3 years of experience, specializing in software architecture and TypeScript development. My experience includes designing and implementing scalable solutions using clean architecture and design patterns. Strong proficiency in developing sophisticated UI components, REST API integration, and maintaining clean, reusable code.",
          "As a professor and technical lead, I have developed strong mentoring and development team leadership skills. Proven experience in implementing unit and integration tests, code reviews, and application performance optimization. While my primary experience is in the React/Next.js ecosystem, I have a solid foundation in object-oriented programming principles and design patterns that facilitate adaptation to new technologies."
        ]
      },
      {
        "id": "2",
        "title": "Frontend Developer / Software Engineer",
        "company": "Mercado Libre",
        "date": "Viernes 13 2024",
        "content": [
          "Desarrollador Frontend con más de 3 años de experiencia especializado en el desarrollo de aplicaciones web de alto rendimiento y escalables. Sólida experiencia en JavaScript, React, y Node.js, con un historial comprobado en la implementación de soluciones frontend que manejan alta concurrencia y tráfico significativo. Mi experiencia en arquitectura limpia y patrones de diseño me permite crear sistemas eficientes y mantenibles que cumplen con los más altos estándares de la industria.",
          "Como líder técnico y educador, he desarrollado fuertes habilidades de comunicación interequipos y mentoría, facilitando la colaboración efectiva en entornos multidisciplinarios. Mi enfoque en la calidad del código, testing y optimización de rendimiento se alinea perfectamente con los requisitos de sistemas de alto desempeño. Complemento mi experiencia técnica con un compromiso continuo con el aprendizaje y la innovación, especialmente en tecnologías web abiertas y metodologías ágiles."
        ]
      }
    ]
  },
  "Experience": {
    "sectionTitle": "Experiencia",
    "JobList": [
      {
        "id": "job1",
        "title": "Profesor en Desarrollo Frontend",
        "company": "Centro de Sistemas de Antioquia - CENSA",
        "badge": "Temporal",
        "location": "Medellín, Antioquia, Colombia",
        "link": "https://www.censa.edu.co/",
        "startDate": "Noviembre 2024",
        "endDate": "Presente",
        "duration": "2 meses",
        "description": [
          "✣ Diseño e implementación de un programa de estudios enfocado en tecnologías web modernas, incluyendo HTML, CSS y JavaScript.",
          "✣ Capacitación práctica en el desarrollo de interfaces de usuario y experiencia de usuario (UI/UX).",
          "✣ Guía en la implementación de mejores prácticas de desarrollo y metodologías ágiles.",
          "✣ Mentoría personalizada para ayudar a los estudiantes a desarrollar proyectos web prácticos.",
          "✣ Evaluación continua del progreso de los estudiantes y adaptación del material didáctico según sus necesidades.",
          "✣ Introducción a herramientas modernas de desarrollo como Git, GitHub y editores de código."
        ],
        "skills": [
          "Frontend Development",
          "HTML",
          "CSS",
          "JavaScript",
          "UI/UX",
          "Git"
        ]
      },
      {
        "id": "job1",
        "title": "Profesor en Desarrollo Frontend",
        "company": "Centro de Sistemas de Antioquia - CENSA",
        "badge": "Temporal",
        "location": "Medellín, Antioquia, Colombia",
        "link": "https://www.censa.edu.co/",
        "startDate": "Noviembre 2024",
        "endDate": "Presente",
        "duration": "2 meses",
        "description": [
          "✣ Diseño e implementación de un programa de estudios enfocado en tecnologías web modernas, incluyendo HTML, CSS y JavaScript.",
          "✣ Capacitación práctica en el desarrollo de interfaces de usuario y experiencia de usuario (UI/UX).",
          "✣ Guía en la implementación de mejores prácticas de desarrollo y metodologías ágiles.",
          "✣ Mentoría personalizada para ayudar a los estudiantes a desarrollar proyectos web prácticos.",
          "✣ Evaluación continua del progreso de los estudiantes y adaptación del material didáctico según sus necesidades.",
          "✣ Introducción a herramientas modernas de desarrollo como Git, GitHub y editores de código."
        ],
        "skills": [
          "Frontend Development",
          "HTML",
          "CSS",
          "JavaScript",
          "UI/UX",
          "Git"
        ]
      }
    ]
  },
  "Education": {
    "sectionTitle": "Educación",
    "SchoolList": [
      {
        "id": "edu1",
        "school": "Servicio Nacional de Aprendizaje SENA",
        "degree": "Análisis y Desarrollo de Software",
        "startDate": "Mayo 2023",
        "endDate": "Agosto 2025"
      },
      {
        "id": "edu2",
        "school": "Nueva Universidad",
        "degree": "Máster en Desarrollo Web",
        "startDate": "2024",
        "endDate": "2025"
      }
    ]
  },
  "Languages": {
    "sectionTitle": "Idiomas",
    "LanguageList": [
      {
        "id": "lang1",
        "name": "Español",
        "level": "Nativo"
      },
      {
        "id": "lang2",
        "name": "Inglés",
        "level": "Intermedio"
      }
    ]
  },
  "navigation": {
    "previous": "Perfil anterior",
    "next": "Siguiente perfil",
    "print": "Imprimir CV"
  }
}